ZehuiLi1/putttrack/firmware/nrf54l15_tag_app/src/main.c
#if defined(CONFIG_PUTTTRACK_NFC_SERVICE)
	ok = ok &&
	     zcbor_tstr_put_lit(zse, "nfc_enabled") &&
	     zcbor_bool_put(zse, true) &&
	     zcbor_tstr_put_lit(zse, "nfc_setup_error") &&
	     zcbor_int32_put(zse, nfc_setup_error) &&
	     zcbor_tstr_put_lit(zse, "nfc_field_on") &&
	     zcbor_uint32_put(zse, (uint32_t)atomic_get(&nfc_field_on_count)) &&
	     zcbor_tstr_put_lit(zse, "nfc_field_off") &&
	     zcbor_uint32_put(zse, (uint32_t)atomic_get(&nfc_field_off_count)) &&
	     zcbor_tstr_put_lit(zse, "nfc_data_reads") &&
	     zcbor_uint32_put(zse, (uint32_t)atomic_get(&nfc_data_read_count)) &&
	     zcbor_tstr_put_lit(zse, "nfc_field_present") &&
	     zcbor_bool_put(zse, atomic_get(&nfc_field_present) != 0) &&
	     zcbor_tstr_put_lit(zse, "nfc_service_window") &&
	     zcbor_bool_put(zse, atomic_get(&nfc_service_window_active) != 0) &&
	     zcbor_tstr_put_lit(zse, "nfc_service_window_ms") &&
	     zcbor_uint32_put(zse, NFC_SERVICE_DISCOVERY_WINDOW_MS) &&
	     zcbor_tstr_put_lit(zse, "nfc_service_window_opens") &&
	     zcbor_uint32_put(zse,
			       (uint32_t)atomic_get(&nfc_service_window_open_count)) &&
	     zcbor_tstr_put_lit(zse, "nfc_service_window_suppressed") &&
	     zcbor_uint32_put(zse,
			       (uint32_t)atomic_get(
				       &nfc_service_window_suppressed_count)) &&
	     zcbor_tstr_put_lit(zse, "system_off_supported") &&
	     zcbor_bool_put(zse,
			     IS_ENABLED(CONFIG_PUTTTRACK_NFC_SYSTEM_OFF_TEST)) &&
	     zcbor_tstr_put_lit(zse, "system_off_pending") &&
	     zcbor_bool_put(zse, atomic_get(&system_off_pending) != 0) &&
	     zcbor_tstr_put_lit(zse, "system_off_entry_error") &&
	     zcbor_int32_put(zse, system_off_entry_error) &&
	     zcbor_tstr_put_lit(zse, "nfc_system_off_wake") &&
	     zcbor_bool_put(zse, nfc_system_off_wake);
#endif

	return ok ? MGMT_ERR_EOK : MGMT_ERR_EMSGSIZE;
}

static int putttrack_mgmt_motion(struct smp_streamer *ctxt)
{
	zcbor_state_t *zse = ctxt->writer->zs;
	uint8_t snapshot[MOTION_PACKET_SIZE];
	bool ok;

	k_mutex_lock(&packet_mutex, K_FOREVER);
	memcpy(snapshot, motion_packet, sizeof(snapshot));
	k_mutex_unlock(&packet_mutex);

	ok = zcbor_tstr_put_lit(zse, "proto") &&
	     zcbor_uint32_put(zse, snapshot[0]) &&
	     zcbor_tstr_put_lit(zse, "seq") &&
	     zcbor_uint32_put(zse, sys_get_le32(&snapshot[4])) &&
	     zcbor_tstr_put_lit(zse, "t_us") &&
	     zcbor_uint64_put(zse, sys_get_le64(&snapshot[8])) &&
	     zcbor_tstr_put_lit(zse, "errors") &&
	     zcbor_uint32_put(zse, sys_get_le32(&snapshot[52])) &&
	     zcbor_tstr_put_lit(zse, "adxl_valid") &&
	     zcbor_bool_put(zse, (snapshot[1] & MOTION_FLAG_ADXL367_VALID) != 0U) &&
	     zcbor_tstr_put_lit(zse, "bmi_valid") &&
	     zcbor_bool_put(zse, (snapshot[1] & MOTION_FLAG_BMI270_VALID) != 0U) &&
	     zcbor_tstr_put_lit(zse, "adxl_ax") &&
	     zcbor_int32_put(zse, (int32_t)sys_get_le32(&snapshot[16])) &&
	     zcbor_tstr_put_lit(zse, "adxl_ay") &&
	     zcbor_int32_put(zse, (int32_t)sys_get_le32(&snapshot[20])) &&
	     zcbor_tstr_put_lit(zse, "adxl_az") &&
	     zcbor_int32_put(zse, (int32_t)sys_get_le32(&snapshot[24])) &&
	     zcbor_tstr_put_lit(zse, "bmi_ax") &&
	     zcbor_int32_put(zse, (int32_t)sys_get_le32(&snapshot[28])) &&
	     zcbor_tstr_put_lit(zse, "bmi_ay") &&
	     zcbor_int32_put(zse, (int32_t)sys_get_le32(&snapshot[32])) &&
	     zcbor_tstr_put_lit(zse, "bmi_az") &&
	     zcbor_int32_put(zse, (int32_t)sys_get_le32(&snapshot[36])) &&
	     zcbor_tstr_put_lit(zse, "bmi_gx") &&
	     zcbor_int32_put(zse, (int32_t)sys_get_le32(&snapshot[40])) &&
	     zcbor_tstr_put_lit(zse, "bmi_gy") &&
	     zcbor_int32_put(zse, (int32_t)sys_get_le32(&snapshot[44])) &&
	     zcbor_tstr_put_lit(zse, "bmi_gz") &&
	     zcbor_int32_put(zse, (int32_t)sys_get_le32(&snapshot[48]));

	return ok ? MGMT_ERR_EOK : MGMT_ERR_EMSGSIZE;
}

static int putttrack_mgmt_window(struct smp_streamer *ctxt)
{
	zcbor_state_t *zse = ctxt->writer->zs;
	struct zcbor_string data_value;
	uint16_t sample_count;
	uint16_t start_index;
	uint32_t start_sequence = 0U;
	uint32_t end_sequence = 0U;
	bool ok;

	k_mutex_lock(&packet_mutex, K_FOREVER);
	sample_count = MIN(motion_ring_count, MOTION_WINDOW_SAMPLES);
	start_index = (motion_ring_write_index + MOTION_HISTORY_SAMPLES - sample_count) %
		      MOTION_HISTORY_SAMPLES;
	for (size_t index = 0; index < sample_count; index++) {
		memcpy(&motion_window_snapshot[index * MOTION_PACKET_SIZE],
		       motion_ring[(start_index + index) % MOTION_HISTORY_SAMPLES],
		       MOTION_PACKET_SIZE);
	}
	k_mutex_unlock(&packet_mutex);

	if (sample_count > 0U) {
		start_sequence = sys_get_le32(&motion_window_snapshot[4]);
		end_sequence = sys_get_le32(
			&motion_window_snapshot[(sample_count - 1U) * MOTION_PACKET_SIZE + 4U]);
	}
	bytes_to_hex(motion_window_snapshot,
		     (size_t)sample_count * MOTION_PACKET_SIZE,
		     motion_window_hex);
	data_value = (struct zcbor_string) {
		.value = (const uint8_t *)motion_window_hex,
		.len = (size_t)sample_count * MOTION_PACKET_SIZE * 2U,
	};

	ok = zcbor_tstr_put_lit(zse, "proto") &&
	     zcbor_uint32_put(zse, PUTTTRACK_PROTOCOL_VERSION) &&
	     zcbor_tstr_put_lit(zse, "sample_size") &&
	     zcbor_uint32_put(zse, MOTION_PACKET_SIZE) &&
	     zcbor_tstr_put_lit(zse, "count") &&
	     zcbor_uint32_put(zse, sample_count) &&
	     zcbor_tstr_put_lit(zse, "start_seq") &&
	     zcbor_uint32_put(zse, start_sequence) &&
	     zcbor_tstr_put_lit(zse, "end_seq") &&
	     zcbor_uint32_put(zse, end_sequence) &&
	     zcbor_tstr_put_lit(zse, "data_hex") &&
	     zcbor_tstr_encode(zse, &data_value);

	return ok ? MGMT_ERR_EOK : MGMT_ERR_EMSGSIZE;
}

static int putttrack_mgmt_freeze_history(struct smp_streamer *ctxt)
{
	zcbor_state_t *zse = ctxt->writer->zs;
	uint16_t sample_count;
	uint16_t start_index;
	uint32_t capture_id;
	uint32_t start_sequence = 0U;
	uint32_t end_sequence = 0U;
	bool ok;

	k_mutex_lock(&packet_mutex, K_FOREVER);
	sample_count = motion_ring_count;
	start_index = (motion_ring_write_index + MOTION_HISTORY_SAMPLES - sample_count) %
		      MOTION_HISTORY_SAMPLES;
	for (size_t index = 0; index < sample_count; index++) {
		memcpy(frozen_motion_history[index],
		       motion_ring[(start_index + index) % MOTION_HISTORY_SAMPLES],
		       MOTION_PACKET_SIZE);
	}
	frozen_motion_count = sample_count;
	frozen_capture_id++;
	capture_id = frozen_capture_id;
	if (sample_count > 0U) {
		start_sequence = sys_get_le32(&frozen_motion_history[0][4]);
		end_sequence = sys_get_le32(&frozen_motion_history[sample_count - 1U][4]);
	}
	k_mutex_unlock(&packet_mutex);

	ok = zcbor_tstr_put_lit(zse, "proto") &&
	     zcbor_uint32_put(zse, PUTTTRACK_PROTOCOL_VERSION) &&
	     zcbor_tstr_put_lit(zse, "capture_id") &&
	     zcbor_uint32_put(zse, capture_id) &&
	     zcbor_tstr_put_lit(zse, "sample_size") &&
	     zcbor_uint32_put(zse, MOTION_PACKET_SIZE) &&
	     zcbor_tstr_put_lit(zse, "count") &&
	     zcbor_uint32_put(zse, sample_count) &&
	     zcbor_tstr_put_lit(zse, "chunk_size") &&
	     zcbor_uint32_put(zse, MOTION_WINDOW_SAMPLES) &&
	     zcbor_tstr_put_lit(zse, "chunk_count") &&
	     zcbor_uint32_put(zse,
			       DIV_ROUND_UP(sample_count, MOTION_WINDOW_SAMPLES)) &&
	     zcbor_tstr_put_lit(zse, "start_seq") &&
	     zcbor_uint32_put(zse, start_sequence) &&
	     zcbor_tstr_put_lit(zse, "end_seq") &&
	     zcbor_uint32_put(zse, end_sequence);

