ZehuiLi1/putttrack/firmware/nrf54l15_tag_app/src/main.c
static int32_t sensor_value_to_i32_micro(const struct sensor_value *value)
{
	int64_t micro = sensor_value_to_micro(value);

	if (micro > INT32_MAX) {
		return INT32_MAX;
	}
	if (micro < INT32_MIN) {
		return INT32_MIN;
	}
	return (int32_t)micro;
}

static bool packet_vector_clipped(const uint8_t *packet, size_t offset,
				  int32_t threshold)
{
	for (size_t index = 0; index < 3; index++) {
		int64_t value = (int32_t)sys_get_le32(&packet[offset + index * 4U]);

		if (value < 0) {
			value = -value;
		}
		if (value >= threshold) {
			return true;
		}
	}
	return false;
}

static void build_status_packet(void)
{
	uint8_t flags = 0U;
	enum putttrack_power_policy policy = atomic_get(&power_policy);
	const size_t fw_len = MIN(strlen(PUTTTRACK_FIRMWARE_VERSION), 8U);

	if (adxl367_ready) {
		flags |= STATUS_FLAG_ADXL367_READY;
	}
	if (bmi270_ready) {
		flags |= STATUS_FLAG_BMI270_READY;
	}
	if (atomic_get(&notify_enabled) != 0) {
		flags |= STATUS_FLAG_NOTIFY_ACTIVE;
	}
	if (atomic_get(&runtime_state) == PUTTTRACK_RUNTIME_ACTIVE) {
		flags |= STATUS_FLAG_RUNTIME_ACTIVE;
	}
	if (policy == PUTTTRACK_POWER_RESEARCH) {
		flags |= STATUS_FLAG_POWER_RESEARCH;
	} else if (policy == PUTTTRACK_POWER_IDLE) {
		flags |= STATUS_FLAG_POWER_IDLE;
	} else {
		flags |= STATUS_FLAG_POWER_AUTO;
	}

	k_mutex_lock(&packet_mutex, K_FOREVER);
	memset(status_packet, 0, sizeof(status_packet));
	status_packet[0] = PUTTTRACK_PROTOCOL_VERSION;
	status_packet[1] = flags;
	sys_put_le16(STATUS_PACKET_SIZE, &status_packet[2]);
	sys_put_le32(sequence, &status_packet[4]);
	sys_put_le64(k_uptime_get(), &status_packet[8]);
	sys_put_le32(reset_cause, &status_packet[16]);
	sys_put_le32(sensor_error_count, &status_packet[20]);
	sys_put_le32(notify_drop_count, &status_packet[24]);
	status_packet[28] = device_id_len;
	status_packet[29] = BOOT_ID_SIZE;
	status_packet[30] = fw_len;
	memcpy(&status_packet[32], device_id, device_id_len);
	memcpy(&status_packet[48], boot_id, BOOT_ID_SIZE);
	memcpy(&status_packet[56], PUTTTRACK_FIRMWARE_VERSION, fw_len);
	k_mutex_unlock(&packet_mutex);
}

static ssize_t read_status(struct bt_conn *conn, const struct bt_gatt_attr *attr,
			   void *buf, uint16_t len, uint16_t offset)
{
	uint8_t snapshot[STATUS_PACKET_SIZE];

	build_status_packet();
	k_mutex_lock(&packet_mutex, K_FOREVER);
	memcpy(snapshot, status_packet, sizeof(snapshot));
	k_mutex_unlock(&packet_mutex);

	return bt_gatt_attr_read(conn, attr, buf, len, offset, snapshot, sizeof(snapshot));
}

static ssize_t read_motion(struct bt_conn *conn, const struct bt_gatt_attr *attr,
			   void *buf, uint16_t len, uint16_t offset)
{
	uint8_t snapshot[MOTION_PACKET_SIZE];

	k_mutex_lock(&packet_mutex, K_FOREVER);
	memcpy(snapshot, motion_packet, sizeof(snapshot));
	k_mutex_unlock(&packet_mutex);

	return bt_gatt_attr_read(conn, attr, buf, len, offset, snapshot, sizeof(snapshot));
}

static void motion_ccc_changed(const struct bt_gatt_attr *attr, uint16_t value)
{
	ARG_UNUSED(attr);
	atomic_set(&notify_enabled, value == BT_GATT_CCC_NOTIFY);
}

BT_GATT_SERVICE_DEFINE(putttrack_service,
	BT_GATT_PRIMARY_SERVICE(&putttrack_service_uuid.uuid),
	BT_GATT_CHARACTERISTIC(&putttrack_status_uuid.uuid,
			       BT_GATT_CHRC_READ,
			       BT_GATT_PERM_READ_ENCRYPT,
			       read_status, NULL, NULL),
	BT_GATT_CHARACTERISTIC(&putttrack_motion_uuid.uuid,
			       BT_GATT_CHRC_READ | BT_GATT_CHRC_NOTIFY,
			       BT_GATT_PERM_READ_ENCRYPT,
			       read_motion, NULL, NULL),
	BT_GATT_CCC(motion_ccc_changed,
		    BT_GATT_PERM_READ_ENCRYPT | BT_GATT_PERM_WRITE_ENCRYPT));

static const struct bt_data advertising_data[] = {
	BT_DATA_BYTES(BT_DATA_FLAGS, BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR),
	BT_DATA_BYTES(BT_DATA_UUID128_ALL, SMP_BT_SVC_UUID_VAL),
};

static struct bt_data scan_response_data[] = {
	{
		.type = BT_DATA_NAME_COMPLETE,
		.data_len = 0U,
		.data = (const uint8_t *)advertising_name,
	},
};

static const struct bt_le_adv_param active_advertising = BT_LE_ADV_PARAM_INIT(
	BT_LE_ADV_OPT_CONN, BT_GAP_ADV_FAST_INT_MIN_2,
	BT_GAP_ADV_FAST_INT_MAX_2, NULL);
static const struct bt_le_adv_param idle_advertising = BT_LE_ADV_PARAM_INIT(
	BT_LE_ADV_OPT_CONN, BT_GAP_MS_TO_ADV_INTERVAL(IDLE_ADV_INTERVAL_MIN_MS),
	BT_GAP_MS_TO_ADV_INTERVAL(IDLE_ADV_INTERVAL_MAX_MS), NULL);

static void advertise(struct k_work *work)
{
	const struct bt_le_adv_param *parameters;
	enum putttrack_sensor_health health = atomic_get(&sensor_health);
	int rc;

	ARG_UNUSED(work);
	if ((atomic_get(&runtime_state) == PUTTTRACK_RUNTIME_IDLE ||
	     health == PUTTTRACK_SENSOR_DEGRADED ||
	     health == PUTTTRACK_SENSOR_QUARANTINED)
#if defined(CONFIG_PUTTTRACK_NFC_SERVICE)
	    && atomic_get(&nfc_service_window_active) == 0
#endif
	) {
		parameters = &idle_advertising;
		current_adv_interval_min_ms = IDLE_ADV_INTERVAL_MIN_MS;
		current_adv_interval_max_ms = IDLE_ADV_INTERVAL_MAX_MS;
	} else {
		parameters = &active_advertising;
		current_adv_interval_min_ms = 100U;
		current_adv_interval_max_ms = 150U;
	}
	rc = bt_le_adv_start(parameters,
			     advertising_data, ARRAY_SIZE(advertising_data),
			     scan_response_data, ARRAY_SIZE(scan_response_data));
	if (rc != 0 && rc != -EALREADY) {
		advertising_start_error_count++;
		(void)k_work_reschedule(&advertise_work,
					K_MSEC(ADVERTISING_RETRY_MS));
	}
}

static void refresh_advertising(void)
{
	if (atomic_get(&bluetooth_ready) == 0 ||
	    atomic_get(&ble_connected) != 0) {
		return;
	}
	(void)bt_le_adv_stop();
	(void)k_work_reschedule(&advertise_work, K_NO_WAIT);
}

#if defined(CONFIG_PUTTTRACK_NFC_SERVICE)
static void close_nfc_service_window(struct k_work *work)
{
	ARG_UNUSED(work);

	if (atomic_cas(&nfc_service_window_active, 1, 0)) {
		refresh_advertising();
	}
}

static void open_nfc_service_window(struct k_work *work)
{
	ARG_UNUSED(work);

	/* A held field must not extend or repeatedly reopen the bounded window. */
	if (!atomic_cas(&nfc_service_window_active, 0, 1)) {
		atomic_inc(&nfc_service_window_suppressed_count);
		return;
	}
	atomic_inc(&nfc_service_window_open_count);
	refresh_advertising();
	(void)k_work_reschedule(&nfc_service_window_close_work,
				K_MSEC(NFC_SERVICE_DISCOVERY_WINDOW_MS));
}
#endif

