ZehuiLi1/putttrack/firmware/nrf54l15_tag_app/src/main.c
static void connected(struct bt_conn *conn, uint8_t err)
{
	ARG_UNUSED(conn);
	if (err != 0U) {
		(void)k_work_reschedule(&advertise_work, K_NO_WAIT);
	} else {
		atomic_set(&ble_connected, 1);
	}
}

static void disconnected(struct bt_conn *conn, uint8_t reason)
{
	ARG_UNUSED(conn);
	ARG_UNUSED(reason);
	atomic_clear(&notify_enabled);
	atomic_clear(&ble_connected);
}

static void recycled(void)
{
	(void)k_work_reschedule(&advertise_work, K_NO_WAIT);
}

BT_CONN_CB_DEFINE(connection_callbacks) = {
	.connected = connected,
	.disconnected = disconnected,
	.recycled = recycled,
};

static void initialize_identity(void)
{
	ssize_t result;

#if defined(CONFIG_PUTTTRACK_NFC_SYSTEM_OFF_TEST)
	uint32_t raw_reset_cause;

#if NRF_POWER_HAS_RESETREAS
	raw_reset_cause = nrf_power_resetreas_get(NRF_POWER);
	nfc_system_off_wake =
		(raw_reset_cause & NRF_POWER_RESETREAS_NFC_MASK) != 0U;
#else
	raw_reset_cause = nrf_reset_resetreas_get(NRF_RESET);
	nfc_system_off_wake =
		(raw_reset_cause & NRF_RESET_RESETREAS_NFC_MASK) != 0U;
#endif
#endif

	result = hwinfo_get_device_id(device_id, sizeof(device_id));
	if (result > 0) {
		device_id_len = MIN((size_t)result, sizeof(device_id));
	} else {
		device_id_len = 0U;
	}

	(void)sys_csrand_get(boot_id, sizeof(boot_id));
	(void)hwinfo_get_reset_cause(&reset_cause);
	(void)hwinfo_clear_reset_cause();
}

static void initialize_sensor_reboot_retention(void)
{
	if (sensor_reboot_retention.magic != SENSOR_RETENTION_MAGIC) {
		sensor_reboot_retention = (struct sensor_reboot_retention) {
			.magic = SENSOR_RETENTION_MAGIC,
		};
	}
}

static int set_sensor_frequency(const struct device *device,
				enum sensor_channel channel, int32_t frequency_hz)
{
	struct sensor_value value = {.val1 = frequency_hz, .val2 = 0};

	return sensor_attr_set(device, channel, SENSOR_ATTR_SAMPLING_FREQUENCY,
			       &value);
}

static int set_adxl367_wakeup_mode(bool enable)
{
	uint8_t register_address = ADXL367_POWER_CTL_REG;
	uint8_t value;
	uint8_t readback;
	uint8_t write_buffer[2];
	int rc;

	rc = i2c_write_read_dt(&adxl367_i2c, &register_address,
			       sizeof(register_address), &value, sizeof(value));
	if (rc != 0) {
		return rc;
	}
	if (enable) {
		value |= ADXL367_POWER_CTL_WAKEUP_BIT;
	} else {
		value &= ~ADXL367_POWER_CTL_WAKEUP_BIT;
	}
	write_buffer[0] = ADXL367_POWER_CTL_REG;
	write_buffer[1] = value;
	rc = i2c_write_dt(&adxl367_i2c, write_buffer, sizeof(write_buffer));
	if (rc != 0) {
		return rc;
	}
	rc = i2c_write_read_dt(&adxl367_i2c, &register_address,
			       sizeof(register_address), &readback, sizeof(readback));
	if (rc != 0) {
		return rc;
	}
	if ((readback & ADXL367_POWER_CTL_WAKEUP_BIT) !=
	    (enable ? ADXL367_POWER_CTL_WAKEUP_BIT : 0U)) {
		return -EIO;
	}
	atomic_set(&adxl367_wakeup_mode_enabled, enable ? 1 : 0);
	return 0;
}

static int update_adxl367_register(uint8_t register_address, uint8_t mask,
				   uint8_t value)
{
	uint8_t current;
	uint8_t readback;
	uint8_t write_buffer[2];
	int rc;

	rc = i2c_write_read_dt(&adxl367_i2c, &register_address,
			       sizeof(register_address), &current, sizeof(current));
	if (rc != 0) {
		return rc;
	}
	write_buffer[0] = register_address;
	write_buffer[1] = (current & ~mask) | (value & mask);
	rc = i2c_write_dt(&adxl367_i2c, write_buffer, sizeof(write_buffer));
	if (rc != 0) {
		return rc;
	}
	rc = i2c_write_read_dt(&adxl367_i2c, &register_address,
			       sizeof(register_address), &readback, sizeof(readback));
	if (rc != 0) {
		return rc;
	}
	return (readback & mask) == (value & mask) ? 0 : -EIO;
}

static int arm_adxl367_activity_detector(void)
{
	int rc;

	/* Re-engaging referenced activity captures the current stationary
	 * orientation as its reference. Default mode keeps activity detection
	 * armed continuously; inactivity must not wake the MCU.
	 */
	rc = update_adxl367_register(ADXL367_ACT_INACT_CTL_REG,
				     ADXL367_ACT_INACT_MODE_MASK, 0U);
	if (rc != 0) {
		return rc;
	}
	return update_adxl367_register(ADXL367_ACT_INACT_CTL_REG,
				       ADXL367_ACT_INACT_MODE_MASK,
				       ADXL367_REFERENCED_ACTIVITY_ONLY);
}

static void adxl367_motion_trigger(const struct device *device,
				   const struct sensor_trigger *trigger)
{
	ARG_UNUSED(device);
	ARG_UNUSED(trigger);
	atomic_set(&idle_wake_requested, 1);
	k_sem_give(&power_event_sem);
}

static int enable_idle_wake_interrupt(void)
{
	int rc;

	if (!adxl367_ready) {
		return -ENODEV;
	}
	rc = arm_adxl367_activity_detector();
	if (rc != 0) {
		return rc;
	}
	/* Referenced activity captures its reference while measurement mode is
	 * engaged. Allow two 12.5 Hz samples to settle before clearing status,
	 * mapping ACT to INT1 and finally selecting wake-up mode.
	 */
	k_sleep(K_MSEC(IDLE_ACTIVITY_REFERENCE_SETTLE_MS));
	rc = sensor_trigger_set(adxl367, &idle_wake_trigger,
				adxl367_motion_trigger);
	if (rc != 0) {
		return rc;
	}
	/* Zephyr maps ACT and INACT together for SENSOR_TRIG_THRESHOLD.
	 * Preserve the GPIO callback but narrow the sensor-side INT1 map so a
	 * stationary INACT event can never be mistaken for motion.
	 */
	rc = update_adxl367_register(ADXL367_INTMAP1_LOWER_REG,
				     ADXL367_INTMAP_ACTIVITY_BIT |
					     ADXL367_INTMAP_INACTIVITY_BIT,
				     ADXL367_INTMAP_ACTIVITY_BIT);
	if (rc != 0) {
		(void)sensor_trigger_set(adxl367, &idle_wake_trigger, NULL);
		return rc;
	}
	atomic_set(&idle_wake_interrupt_enabled, 1);
	return 0;
}

static int disable_idle_wake_interrupt(void)
{
	int rc;

	if (atomic_get(&idle_wake_interrupt_enabled) == 0) {
		return 0;
	}
	rc = sensor_trigger_set(adxl367, &idle_wake_trigger, NULL);
	if (rc == 0) {
		atomic_clear(&idle_wake_interrupt_enabled);
		atomic_clear(&idle_wake_requested);
	}
	return rc;
}

static void increment_saturating(uint32_t *value)
{
	if (*value != UINT32_MAX) {
		(*value)++;
	}
}

static void clear_motion_history(void)
{
	k_mutex_lock(&packet_mutex, K_FOREVER);
	motion_ring_write_index = 0U;
	motion_ring_count = 0U;
	frozen_motion_count = 0U;
	frozen_capture_id++;
	k_mutex_unlock(&packet_mutex);
}

