ZehuiLi1/putttrack/firmware/nrf54l15_tag_app/src/main.c
static void begin_sensor_recovery(uint32_t error_bits)
{
	enum putttrack_sensor_health health = atomic_get(&sensor_health);

	if (health == PUTTTRACK_SENSOR_RECOVERING ||
	    health == PUTTTRACK_SENSOR_DEGRADED ||
	    health == PUTTTRACK_SENSOR_QUARANTINED) {
		return;
	}

	last_sensor_error_bits = error_bits;
	last_sensor_error_uptime_ms = (uint64_t)k_uptime_get();
	increment_saturating(&sensor_fault_count);
	increment_saturating(&sensor_recovery_generation);
	sensor_recovery_attempts_in_episode = 0U;
	next_sensor_recovery_ms = k_uptime_get();
	current_stream_rate_hz = 0U;
	active_previous_adxl_valid = false;
	idle_adxl_baseline_valid = false;
	idle_wake_samples = 0U;

	if ((error_bits & (SENSOR_ERROR_ADXL367_FETCH |
			   SENSOR_ERROR_ADXL367_READ)) != 0U) {
		adxl367_ready = false;
		adxl367_error_streak = SENSOR_FAILURE_STREAK_LIMIT;
	}
	if ((error_bits & (SENSOR_ERROR_BMI270_FETCH |
			   SENSOR_ERROR_BMI270_ACCEL |
			   SENSOR_ERROR_BMI270_GYRO)) != 0U) {
		bmi270_ready = false;
		bmi270_error_streak = SENSOR_FAILURE_STREAK_LIMIT;
	}
	if (atomic_get(&idle_wake_interrupt_enabled) != 0 &&
	    disable_idle_wake_interrupt() != 0) {
		increment_saturating(&power_management_error_count);
	}
	clear_motion_history();
	atomic_set(&runtime_state, PUTTTRACK_RUNTIME_ACTIVE);
	atomic_set(&sensor_health, PUTTTRACK_SENSOR_RECOVERING);
	refresh_advertising();
}

static void record_sensor_sample_result(uint32_t error_bits)
{
	if (error_bits == 0U) {
		adxl367_error_streak = 0U;
		bmi270_error_streak = 0U;
		if (atomic_get(&sensor_health) == PUTTTRACK_SENSOR_SUSPECT) {
			atomic_set(&sensor_health, PUTTTRACK_SENSOR_HEALTHY);
			sensor_healthy_since_ms = k_uptime_get();
		}
		return;
	}

	increment_saturating(&sensor_error_count);
	last_sensor_error_bits = error_bits;
	last_sensor_error_uptime_ms = (uint64_t)k_uptime_get();
	if ((error_bits & (SENSOR_ERROR_ADXL367_FETCH |
			   SENSOR_ERROR_ADXL367_READ)) != 0U) {
		increment_saturating(&adxl367_error_streak);
	} else {
		adxl367_error_streak = 0U;
	}
	if ((error_bits & (SENSOR_ERROR_BMI270_FETCH |
			   SENSOR_ERROR_BMI270_ACCEL |
			   SENSOR_ERROR_BMI270_GYRO)) != 0U) {
		increment_saturating(&bmi270_error_streak);
	} else {
		bmi270_error_streak = 0U;
	}

	if (adxl367_error_streak >= SENSOR_FAILURE_STREAK_LIMIT ||
	    bmi270_error_streak >= SENSOR_FAILURE_STREAK_LIMIT) {
		begin_sensor_recovery(error_bits);
	} else if (atomic_get(&sensor_health) == PUTTTRACK_SENSOR_HEALTHY) {
		atomic_set(&sensor_health, PUTTTRACK_SENSOR_SUSPECT);
	}
}

static uint32_t verify_active_sensor_samples(void)
{
	struct sensor_value adxl_accel[3];
	struct sensor_value bmi_accel[3];
	struct sensor_value bmi_gyro[3];
	uint32_t errors = 0U;

	if (!device_is_ready(adxl367) || sensor_sample_fetch(adxl367) != 0) {
		errors |= SENSOR_ERROR_ADXL367_FETCH;
	} else if (sensor_channel_get(adxl367, SENSOR_CHAN_ACCEL_XYZ,
				      adxl_accel) != 0) {
		errors |= SENSOR_ERROR_ADXL367_READ;
	}

	if (!device_is_ready(bmi270) || sensor_sample_fetch(bmi270) != 0) {
		errors |= SENSOR_ERROR_BMI270_FETCH;
	} else {
		if (sensor_channel_get(bmi270, SENSOR_CHAN_ACCEL_XYZ,
				       bmi_accel) != 0) {
			errors |= SENSOR_ERROR_BMI270_ACCEL;
		}
		if (sensor_channel_get(bmi270, SENSOR_CHAN_GYRO_XYZ,
				       bmi_gyro) != 0) {
			errors |= SENSOR_ERROR_BMI270_GYRO;
		}
	}
	return errors;
}

static int configure_active_sensors(void)
{
	int failures = 0;

	if (adxl367_ready) {
		if (set_sensor_frequency(adxl367, SENSOR_CHAN_ACCEL_XYZ,
					 ADXL367_ODR_HZ) == 0) {
			current_adxl367_odr_hz = ADXL367_ODR_HZ;
		} else {
			failures++;
		}
	}
	if (bmi270_ready) {
		if (set_sensor_frequency(bmi270, SENSOR_CHAN_ACCEL_XYZ,
					 BMI270_ACCEL_ODR_HZ) == 0) {
			current_bmi270_accel_odr_hz = BMI270_ACCEL_ODR_HZ;
		} else {
			failures++;
		}
		if (set_sensor_frequency(bmi270, SENSOR_CHAN_GYRO_XYZ,
					 BMI270_GYRO_ODR_HZ) == 0) {
			current_bmi270_gyro_odr_hz = BMI270_GYRO_ODR_HZ;
		} else {
			failures++;
		}
	}
	if (failures != 0) {
		for (int failure = 0; failure < failures; failure++) {
			increment_saturating(&sensor_error_count);
		}
		return -EIO;
	}
	return 0;
}

static int configure_bmi270_full_scale(void)
{
	struct sensor_value value;

	if (!bmi270_ready) {
		return -ENODEV;
	}
	value = (struct sensor_value){.val1 = BMI270_ACCEL_RANGE_G, .val2 = 0};
	if (sensor_attr_set(bmi270, SENSOR_CHAN_ACCEL_XYZ,
			    SENSOR_ATTR_FULL_SCALE, &value) != 0) {
		return -EIO;
	}
	value = (struct sensor_value){.val1 = BMI270_GYRO_RANGE_DPS, .val2 = 0};
	return sensor_attr_set(bmi270, SENSOR_CHAN_GYRO_XYZ,
			       SENSOR_ATTR_FULL_SCALE, &value);
}

static int configure_idle_sensors(void)
{
	int failures = 0;

	/* Disable the high-power gyro and BMI270 acceleration path before
	 * reducing the always-on ADXL367 output rate.
	 */
	if (bmi270_ready) {
		if (set_sensor_frequency(bmi270, SENSOR_CHAN_GYRO_XYZ, 0) == 0) {
			current_bmi270_gyro_odr_hz = 0U;
		} else {
			failures++;
		}
		if (set_sensor_frequency(bmi270, SENSOR_CHAN_ACCEL_XYZ, 0) == 0) {
			current_bmi270_accel_odr_hz = 0U;
		} else {
			failures++;
		}
	}
	if (adxl367_ready) {
		if (set_sensor_frequency(adxl367, SENSOR_CHAN_ACCEL_XYZ,
					 IDLE_ADXL367_ODR_HZ) == 0) {
			current_adxl367_odr_hz = IDLE_ADXL367_ODR_HZ;
		} else {
			failures++;
		}
	}
	if (failures != 0) {
		for (int failure = 0; failure < failures; failure++) {
			increment_saturating(&sensor_error_count);
		}
		return -EIO;
	}
	return 0;
}

static void initialize_sensors(void)
{
	uint32_t errors = 0U;

	adxl367_ready = device_is_ready(adxl367);
	bmi270_ready = device_is_ready(bmi270);

	if (!adxl367_ready) {
		errors |= SENSOR_ERROR_ADXL367_FETCH;
	}
	if (!bmi270_ready || configure_bmi270_full_scale() != 0) {
		errors |= SENSOR_ERROR_BMI270_FETCH;
	}
	if (configure_active_sensors() != 0) {
		errors |= SENSOR_ERROR_ADXL367_FETCH | SENSOR_ERROR_BMI270_FETCH;
	}
	for (size_t sample = 0U; errors == 0U && sample < 3U; sample++) {
		errors = verify_active_sensor_samples();
		if (errors == 0U && sample < 2U) {
			k_sleep(K_MSEC(20));
		}
	}
	if (errors != 0U) {
		increment_saturating(&sensor_error_count);
		begin_sensor_recovery(errors);
	} else {
		atomic_set(&sensor_health, PUTTTRACK_SENSOR_HEALTHY);
		sensor_healthy_since_ms = k_uptime_get();
	}

	last_active_motion_ms = k_uptime_get();
}

static uint32_t recovery_retry_delay_ms(uint8_t attempts)
{
	return attempts <= 1U ? SENSOR_RECOVERY_RETRY_INITIAL_MS :
		SENSOR_RECOVERY_RETRY_SECOND_MS;
}

static void attempt_sensor_recovery(void)
{
	uint32_t errors;
	int rc;

