ZehuiLi1/putttrack/firmware/nrf54l15_tag_app/src/main.c
	/*
	 * An OTA candidate may boot through the already-installed v0.1.13
	 * MCUboot image, whose board definition selects these pads as GPIO. Restore
	 * NFCT mode before nrfx validates PADCONFIG so the first NFC experiment does
	 * not require replacing MCUboot over SWD.
	 */
	nrf_nfct_pad_config_enable_set(NRF_NFCT, true);
	rc = nfc_t2t_setup(nfc_callback, NULL);
	if (rc == 0) {
		rc = nfc_ndef_uri_msg_encode(NFC_URI_NONE,
					     (const uint8_t *)uri,
					     (uint16_t)uri_length,
					     nfc_ndef_buffer,
					     &ndef_length);
	}
	if (rc == 0) {
		rc = nfc_t2t_payload_set(nfc_ndef_buffer, ndef_length);
	}
	if (rc == 0) {
		rc = nfc_t2t_emulation_start();
	}
	nfc_setup_error = rc;

	return rc;
}
#endif

int main(void)
{
	int64_t next_sample_ms;
	uint32_t previous_period_ms = 0U;

	initialize_sensor_reboot_retention();
	initialize_identity();
	initialize_advertising_name();
	scan_response_data[0].data_len = (uint8_t)strlen(advertising_name);
	k_work_init_delayable(&advertise_work, advertise);
#if defined(CONFIG_PUTTTRACK_NFC_SERVICE)
	k_work_init(&nfc_service_window_open_work, open_nfc_service_window);
	k_work_init_delayable(&nfc_service_window_close_work,
			      close_nfc_service_window);
#if defined(CONFIG_PUTTTRACK_NFC_SYSTEM_OFF_TEST)
	k_work_init_delayable(&system_off_work, enter_system_off);
#endif
#endif
	sample_battery();
	initialize_sensors();
	if (bt_enable(NULL) == 0) {
		atomic_set(&bluetooth_ready, 1);
		(void)k_work_reschedule(&advertise_work, K_NO_WAIT);
	}
#if defined(CONFIG_PUTTTRACK_NFC_SERVICE)
	if (initialize_nfc_service() == 0 && nfc_system_off_wake) {
		(void)k_work_submit(&nfc_service_window_open_work);
	}
#endif
	build_status_packet();

	next_sample_ms = k_uptime_get();
	while (true) {
		enum putttrack_power_policy policy = atomic_get(&power_policy);
		enum putttrack_runtime_state state = atomic_get(&runtime_state);
		enum putttrack_sensor_health health;
		uint32_t period_ms;
		uint32_t idle_health_interval_ms;
		int64_t now_ms;
		int64_t guard_wait_ms;
		int64_t idle_health_wait_ms;
		int64_t event_wait_ms;

		service_sensor_recovery_policy();
		health = atomic_get(&sensor_health);
		if (health == PUTTTRACK_SENSOR_RECOVERING ||
		    health == PUTTTRACK_SENSOR_DEGRADED ||
		    health == PUTTTRACK_SENSOR_QUARANTINED) {
			previous_period_ms = 250U;
			k_sleep(K_MSEC(250));
			continue;
		}

		if (policy == PUTTTRACK_POWER_IDLE &&
		    state != PUTTTRACK_RUNTIME_IDLE) {
			(void)enter_idle_state();
		} else if (policy == PUTTTRACK_POWER_RESEARCH &&
			   state != PUTTTRACK_RUNTIME_ACTIVE) {
			(void)enter_active_state();
		}

		state = atomic_get(&runtime_state);
		if (state == PUTTTRACK_RUNTIME_ACTIVE) {
			if (sample_motion()) {
				last_active_motion_ms = k_uptime_get();
			}
			if (policy == PUTTTRACK_POWER_AUTO &&
			    atomic_get(&sensor_health) == PUTTTRACK_SENSOR_HEALTHY &&
			    k_uptime_get() - last_active_motion_ms >= AUTO_IDLE_TIMEOUT_MS) {
				(void)enter_idle_state();
			}
		} else if (atomic_get(&idle_wake_interrupt_enabled) != 0) {
			if (atomic_cas(&idle_wake_requested, 1, 0) &&
			    policy == PUTTTRACK_POWER_AUTO) {
				(void)enter_active_state();
			} else {
				idle_health_interval_ms =
					atomic_get(&sensor_health) == PUTTTRACK_SENSOR_SUSPECT ?
					SUSPECT_SENSOR_HEALTH_CHECK_MS :
					IDLE_SENSOR_HEALTH_CHECK_MS;
				if (k_uptime_get() - last_idle_sensor_health_check_ms >=
				    idle_health_interval_ms) {
					last_idle_sensor_health_check_ms = k_uptime_get();
					if (sample_idle_wake_sensor() &&
					    policy == PUTTTRACK_POWER_AUTO) {
						(void)enter_active_state();
					}
				}
			}
		} else if (sample_idle_wake_sensor() &&
			   policy == PUTTTRACK_POWER_AUTO) {
			(void)enter_active_state();
		}

		state = atomic_get(&runtime_state);
		if (state == PUTTTRACK_RUNTIME_IDLE &&
		    atomic_get(&idle_wake_interrupt_enabled) != 0) {
			previous_period_ms = 0U;
			health = atomic_get(&sensor_health);
			idle_health_interval_ms =
				health == PUTTTRACK_SENSOR_SUSPECT ?
				SUSPECT_SENSOR_HEALTH_CHECK_MS :
				IDLE_SENSOR_HEALTH_CHECK_MS;
			idle_health_wait_ms = idle_health_interval_ms -
				(k_uptime_get() - last_idle_sensor_health_check_ms);
			event_wait_ms = idle_health_wait_ms;
			guard_wait_ms = SENSOR_REBOOT_GUARD_CLEAR_MS -
				(k_uptime_get() - sensor_healthy_since_ms);
			if (sensor_reboot_retention.guard != 0U && guard_wait_ms > 0 &&
			    guard_wait_ms < event_wait_ms) {
				event_wait_ms = guard_wait_ms;
			}
			if (event_wait_ms > 0) {
				(void)k_sem_take(&power_event_sem, K_MSEC(event_wait_ms));
			} else {
				k_yield();
			}
			continue;
		}
		period_ms = state == PUTTTRACK_RUNTIME_ACTIVE ?
			20U : IDLE_WAKE_SAMPLE_PERIOD_MS;
		now_ms = k_uptime_get();
		if (period_ms != previous_period_ms) {
			next_sample_ms = now_ms + period_ms;
		} else {
			next_sample_ms += period_ms;
			if (next_sample_ms <= now_ms) {
				next_sample_ms = now_ms + period_ms;
			}
		}
		previous_period_ms = period_ms;
		k_sleep(K_TIMEOUT_ABS_MS(next_sample_ms));
	}

	return 0;
}
